###################################################################

# Created by write_sdc on Fri Aug  1 20:28:44 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_transition 0.1 [current_design]
set_max_fanout 20 [current_design]
set_max_area 0
set_load -pin_load 0.003 [get_ports {data_out[63]}]
set_load -pin_load 0.003 [get_ports {data_out[62]}]
set_load -pin_load 0.003 [get_ports {data_out[61]}]
set_load -pin_load 0.003 [get_ports {data_out[60]}]
set_load -pin_load 0.003 [get_ports {data_out[59]}]
set_load -pin_load 0.003 [get_ports {data_out[58]}]
set_load -pin_load 0.003 [get_ports {data_out[57]}]
set_load -pin_load 0.003 [get_ports {data_out[56]}]
set_load -pin_load 0.003 [get_ports {data_out[55]}]
set_load -pin_load 0.003 [get_ports {data_out[54]}]
set_load -pin_load 0.003 [get_ports {data_out[53]}]
set_load -pin_load 0.003 [get_ports {data_out[52]}]
set_load -pin_load 0.003 [get_ports {data_out[51]}]
set_load -pin_load 0.003 [get_ports {data_out[50]}]
set_load -pin_load 0.003 [get_ports {data_out[49]}]
set_load -pin_load 0.003 [get_ports {data_out[48]}]
set_load -pin_load 0.003 [get_ports {data_out[47]}]
set_load -pin_load 0.003 [get_ports {data_out[46]}]
set_load -pin_load 0.003 [get_ports {data_out[45]}]
set_load -pin_load 0.003 [get_ports {data_out[44]}]
set_load -pin_load 0.003 [get_ports {data_out[43]}]
set_load -pin_load 0.003 [get_ports {data_out[42]}]
set_load -pin_load 0.003 [get_ports {data_out[41]}]
set_load -pin_load 0.003 [get_ports {data_out[40]}]
set_load -pin_load 0.003 [get_ports {data_out[39]}]
set_load -pin_load 0.003 [get_ports {data_out[38]}]
set_load -pin_load 0.003 [get_ports {data_out[37]}]
set_load -pin_load 0.003 [get_ports {data_out[36]}]
set_load -pin_load 0.003 [get_ports {data_out[35]}]
set_load -pin_load 0.003 [get_ports {data_out[34]}]
set_load -pin_load 0.003 [get_ports {data_out[33]}]
set_load -pin_load 0.003 [get_ports {data_out[32]}]
set_load -pin_load 0.003 [get_ports {data_out[31]}]
set_load -pin_load 0.003 [get_ports {data_out[30]}]
set_load -pin_load 0.003 [get_ports {data_out[29]}]
set_load -pin_load 0.003 [get_ports {data_out[28]}]
set_load -pin_load 0.003 [get_ports {data_out[27]}]
set_load -pin_load 0.003 [get_ports {data_out[26]}]
set_load -pin_load 0.003 [get_ports {data_out[25]}]
set_load -pin_load 0.003 [get_ports {data_out[24]}]
set_load -pin_load 0.003 [get_ports {data_out[23]}]
set_load -pin_load 0.003 [get_ports {data_out[22]}]
set_load -pin_load 0.003 [get_ports {data_out[21]}]
set_load -pin_load 0.003 [get_ports {data_out[20]}]
set_load -pin_load 0.003 [get_ports {data_out[19]}]
set_load -pin_load 0.003 [get_ports {data_out[18]}]
set_load -pin_load 0.003 [get_ports {data_out[17]}]
set_load -pin_load 0.003 [get_ports {data_out[16]}]
set_load -pin_load 0.003 [get_ports {data_out[15]}]
set_load -pin_load 0.003 [get_ports {data_out[14]}]
set_load -pin_load 0.003 [get_ports {data_out[13]}]
set_load -pin_load 0.003 [get_ports {data_out[12]}]
set_load -pin_load 0.003 [get_ports {data_out[11]}]
set_load -pin_load 0.003 [get_ports {data_out[10]}]
set_load -pin_load 0.003 [get_ports {data_out[9]}]
set_load -pin_load 0.003 [get_ports {data_out[8]}]
set_load -pin_load 0.003 [get_ports {data_out[7]}]
set_load -pin_load 0.003 [get_ports {data_out[6]}]
set_load -pin_load 0.003 [get_ports {data_out[5]}]
set_load -pin_load 0.003 [get_ports {data_out[4]}]
set_load -pin_load 0.003 [get_ports {data_out[3]}]
set_load -pin_load 0.003 [get_ports {data_out[2]}]
set_load -pin_load 0.003 [get_ports {data_out[1]}]
set_load -pin_load 0.003 [get_ports {data_out[0]}]
set_load -pin_load 0.003 [get_ports single_error]
set_load -pin_load 0.003 [get_ports double_error]
set_load -pin_load 0.003 [get_ports no_error]
set_load -pin_load 0.003 [get_ports {error_position[6]}]
set_load -pin_load 0.003 [get_ports {error_position[5]}]
set_load -pin_load 0.003 [get_ports {error_position[4]}]
set_load -pin_load 0.003 [get_ports {error_position[3]}]
set_load -pin_load 0.003 [get_ports {error_position[2]}]
set_load -pin_load 0.003 [get_ports {error_position[1]}]
set_load -pin_load 0.003 [get_ports {error_position[0]}]
