###################################################################

# Created by write_sdc on Fri Aug  1 20:30:04 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_transition 0.1 [current_design]
set_max_fanout 20 [current_design]
set_max_area 0
set_load -pin_load 0.003 [get_ports {code_out[135]}]
set_load -pin_load 0.003 [get_ports {code_out[134]}]
set_load -pin_load 0.003 [get_ports {code_out[133]}]
set_load -pin_load 0.003 [get_ports {code_out[132]}]
set_load -pin_load 0.003 [get_ports {code_out[131]}]
set_load -pin_load 0.003 [get_ports {code_out[130]}]
set_load -pin_load 0.003 [get_ports {code_out[129]}]
set_load -pin_load 0.003 [get_ports {code_out[128]}]
set_load -pin_load 0.003 [get_ports {code_out[127]}]
set_load -pin_load 0.003 [get_ports {code_out[126]}]
set_load -pin_load 0.003 [get_ports {code_out[125]}]
set_load -pin_load 0.003 [get_ports {code_out[124]}]
set_load -pin_load 0.003 [get_ports {code_out[123]}]
set_load -pin_load 0.003 [get_ports {code_out[122]}]
set_load -pin_load 0.003 [get_ports {code_out[121]}]
set_load -pin_load 0.003 [get_ports {code_out[120]}]
set_load -pin_load 0.003 [get_ports {code_out[119]}]
set_load -pin_load 0.003 [get_ports {code_out[118]}]
set_load -pin_load 0.003 [get_ports {code_out[117]}]
set_load -pin_load 0.003 [get_ports {code_out[116]}]
set_load -pin_load 0.003 [get_ports {code_out[115]}]
set_load -pin_load 0.003 [get_ports {code_out[114]}]
set_load -pin_load 0.003 [get_ports {code_out[113]}]
set_load -pin_load 0.003 [get_ports {code_out[112]}]
set_load -pin_load 0.003 [get_ports {code_out[111]}]
set_load -pin_load 0.003 [get_ports {code_out[110]}]
set_load -pin_load 0.003 [get_ports {code_out[109]}]
set_load -pin_load 0.003 [get_ports {code_out[108]}]
set_load -pin_load 0.003 [get_ports {code_out[107]}]
set_load -pin_load 0.003 [get_ports {code_out[106]}]
set_load -pin_load 0.003 [get_ports {code_out[105]}]
set_load -pin_load 0.003 [get_ports {code_out[104]}]
set_load -pin_load 0.003 [get_ports {code_out[103]}]
set_load -pin_load 0.003 [get_ports {code_out[102]}]
set_load -pin_load 0.003 [get_ports {code_out[101]}]
set_load -pin_load 0.003 [get_ports {code_out[100]}]
set_load -pin_load 0.003 [get_ports {code_out[99]}]
set_load -pin_load 0.003 [get_ports {code_out[98]}]
set_load -pin_load 0.003 [get_ports {code_out[97]}]
set_load -pin_load 0.003 [get_ports {code_out[96]}]
set_load -pin_load 0.003 [get_ports {code_out[95]}]
set_load -pin_load 0.003 [get_ports {code_out[94]}]
set_load -pin_load 0.003 [get_ports {code_out[93]}]
set_load -pin_load 0.003 [get_ports {code_out[92]}]
set_load -pin_load 0.003 [get_ports {code_out[91]}]
set_load -pin_load 0.003 [get_ports {code_out[90]}]
set_load -pin_load 0.003 [get_ports {code_out[89]}]
set_load -pin_load 0.003 [get_ports {code_out[88]}]
set_load -pin_load 0.003 [get_ports {code_out[87]}]
set_load -pin_load 0.003 [get_ports {code_out[86]}]
set_load -pin_load 0.003 [get_ports {code_out[85]}]
set_load -pin_load 0.003 [get_ports {code_out[84]}]
set_load -pin_load 0.003 [get_ports {code_out[83]}]
set_load -pin_load 0.003 [get_ports {code_out[82]}]
set_load -pin_load 0.003 [get_ports {code_out[81]}]
set_load -pin_load 0.003 [get_ports {code_out[80]}]
set_load -pin_load 0.003 [get_ports {code_out[79]}]
set_load -pin_load 0.003 [get_ports {code_out[78]}]
set_load -pin_load 0.003 [get_ports {code_out[77]}]
set_load -pin_load 0.003 [get_ports {code_out[76]}]
set_load -pin_load 0.003 [get_ports {code_out[75]}]
set_load -pin_load 0.003 [get_ports {code_out[74]}]
set_load -pin_load 0.003 [get_ports {code_out[73]}]
set_load -pin_load 0.003 [get_ports {code_out[72]}]
set_load -pin_load 0.003 [get_ports {code_out[71]}]
set_load -pin_load 0.003 [get_ports {code_out[70]}]
set_load -pin_load 0.003 [get_ports {code_out[69]}]
set_load -pin_load 0.003 [get_ports {code_out[68]}]
set_load -pin_load 0.003 [get_ports {code_out[67]}]
set_load -pin_load 0.003 [get_ports {code_out[66]}]
set_load -pin_load 0.003 [get_ports {code_out[65]}]
set_load -pin_load 0.003 [get_ports {code_out[64]}]
set_load -pin_load 0.003 [get_ports {code_out[63]}]
set_load -pin_load 0.003 [get_ports {code_out[62]}]
set_load -pin_load 0.003 [get_ports {code_out[61]}]
set_load -pin_load 0.003 [get_ports {code_out[60]}]
set_load -pin_load 0.003 [get_ports {code_out[59]}]
set_load -pin_load 0.003 [get_ports {code_out[58]}]
set_load -pin_load 0.003 [get_ports {code_out[57]}]
set_load -pin_load 0.003 [get_ports {code_out[56]}]
set_load -pin_load 0.003 [get_ports {code_out[55]}]
set_load -pin_load 0.003 [get_ports {code_out[54]}]
set_load -pin_load 0.003 [get_ports {code_out[53]}]
set_load -pin_load 0.003 [get_ports {code_out[52]}]
set_load -pin_load 0.003 [get_ports {code_out[51]}]
set_load -pin_load 0.003 [get_ports {code_out[50]}]
set_load -pin_load 0.003 [get_ports {code_out[49]}]
set_load -pin_load 0.003 [get_ports {code_out[48]}]
set_load -pin_load 0.003 [get_ports {code_out[47]}]
set_load -pin_load 0.003 [get_ports {code_out[46]}]
set_load -pin_load 0.003 [get_ports {code_out[45]}]
set_load -pin_load 0.003 [get_ports {code_out[44]}]
set_load -pin_load 0.003 [get_ports {code_out[43]}]
set_load -pin_load 0.003 [get_ports {code_out[42]}]
set_load -pin_load 0.003 [get_ports {code_out[41]}]
set_load -pin_load 0.003 [get_ports {code_out[40]}]
set_load -pin_load 0.003 [get_ports {code_out[39]}]
set_load -pin_load 0.003 [get_ports {code_out[38]}]
set_load -pin_load 0.003 [get_ports {code_out[37]}]
set_load -pin_load 0.003 [get_ports {code_out[36]}]
set_load -pin_load 0.003 [get_ports {code_out[35]}]
set_load -pin_load 0.003 [get_ports {code_out[34]}]
set_load -pin_load 0.003 [get_ports {code_out[33]}]
set_load -pin_load 0.003 [get_ports {code_out[32]}]
set_load -pin_load 0.003 [get_ports {code_out[31]}]
set_load -pin_load 0.003 [get_ports {code_out[30]}]
set_load -pin_load 0.003 [get_ports {code_out[29]}]
set_load -pin_load 0.003 [get_ports {code_out[28]}]
set_load -pin_load 0.003 [get_ports {code_out[27]}]
set_load -pin_load 0.003 [get_ports {code_out[26]}]
set_load -pin_load 0.003 [get_ports {code_out[25]}]
set_load -pin_load 0.003 [get_ports {code_out[24]}]
set_load -pin_load 0.003 [get_ports {code_out[23]}]
set_load -pin_load 0.003 [get_ports {code_out[22]}]
set_load -pin_load 0.003 [get_ports {code_out[21]}]
set_load -pin_load 0.003 [get_ports {code_out[20]}]
set_load -pin_load 0.003 [get_ports {code_out[19]}]
set_load -pin_load 0.003 [get_ports {code_out[18]}]
set_load -pin_load 0.003 [get_ports {code_out[17]}]
set_load -pin_load 0.003 [get_ports {code_out[16]}]
set_load -pin_load 0.003 [get_ports {code_out[15]}]
set_load -pin_load 0.003 [get_ports {code_out[14]}]
set_load -pin_load 0.003 [get_ports {code_out[13]}]
set_load -pin_load 0.003 [get_ports {code_out[12]}]
set_load -pin_load 0.003 [get_ports {code_out[11]}]
set_load -pin_load 0.003 [get_ports {code_out[10]}]
set_load -pin_load 0.003 [get_ports {code_out[9]}]
set_load -pin_load 0.003 [get_ports {code_out[8]}]
set_load -pin_load 0.003 [get_ports {code_out[7]}]
set_load -pin_load 0.003 [get_ports {code_out[6]}]
set_load -pin_load 0.003 [get_ports {code_out[5]}]
set_load -pin_load 0.003 [get_ports {code_out[4]}]
set_load -pin_load 0.003 [get_ports {code_out[3]}]
set_load -pin_load 0.003 [get_ports {code_out[2]}]
set_load -pin_load 0.003 [get_ports {code_out[1]}]
set_load -pin_load 0.003 [get_ports {code_out[0]}]
