###################################################################

# Created by write_sdc on Fri Aug  1 20:29:25 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_transition 0.1 [current_design]
set_max_fanout 20 [current_design]
set_max_area 0
set_load -pin_load 0.003 [get_ports {code_out[71]}]
set_load -pin_load 0.003 [get_ports {code_out[70]}]
set_load -pin_load 0.003 [get_ports {code_out[69]}]
set_load -pin_load 0.003 [get_ports {code_out[68]}]
set_load -pin_load 0.003 [get_ports {code_out[67]}]
set_load -pin_load 0.003 [get_ports {code_out[66]}]
set_load -pin_load 0.003 [get_ports {code_out[65]}]
set_load -pin_load 0.003 [get_ports {code_out[64]}]
set_load -pin_load 0.003 [get_ports {code_out[63]}]
set_load -pin_load 0.003 [get_ports {code_out[62]}]
set_load -pin_load 0.003 [get_ports {code_out[61]}]
set_load -pin_load 0.003 [get_ports {code_out[60]}]
set_load -pin_load 0.003 [get_ports {code_out[59]}]
set_load -pin_load 0.003 [get_ports {code_out[58]}]
set_load -pin_load 0.003 [get_ports {code_out[57]}]
set_load -pin_load 0.003 [get_ports {code_out[56]}]
set_load -pin_load 0.003 [get_ports {code_out[55]}]
set_load -pin_load 0.003 [get_ports {code_out[54]}]
set_load -pin_load 0.003 [get_ports {code_out[53]}]
set_load -pin_load 0.003 [get_ports {code_out[52]}]
set_load -pin_load 0.003 [get_ports {code_out[51]}]
set_load -pin_load 0.003 [get_ports {code_out[50]}]
set_load -pin_load 0.003 [get_ports {code_out[49]}]
set_load -pin_load 0.003 [get_ports {code_out[48]}]
set_load -pin_load 0.003 [get_ports {code_out[47]}]
set_load -pin_load 0.003 [get_ports {code_out[46]}]
set_load -pin_load 0.003 [get_ports {code_out[45]}]
set_load -pin_load 0.003 [get_ports {code_out[44]}]
set_load -pin_load 0.003 [get_ports {code_out[43]}]
set_load -pin_load 0.003 [get_ports {code_out[42]}]
set_load -pin_load 0.003 [get_ports {code_out[41]}]
set_load -pin_load 0.003 [get_ports {code_out[40]}]
set_load -pin_load 0.003 [get_ports {code_out[39]}]
set_load -pin_load 0.003 [get_ports {code_out[38]}]
set_load -pin_load 0.003 [get_ports {code_out[37]}]
set_load -pin_load 0.003 [get_ports {code_out[36]}]
set_load -pin_load 0.003 [get_ports {code_out[35]}]
set_load -pin_load 0.003 [get_ports {code_out[34]}]
set_load -pin_load 0.003 [get_ports {code_out[33]}]
set_load -pin_load 0.003 [get_ports {code_out[32]}]
set_load -pin_load 0.003 [get_ports {code_out[31]}]
set_load -pin_load 0.003 [get_ports {code_out[30]}]
set_load -pin_load 0.003 [get_ports {code_out[29]}]
set_load -pin_load 0.003 [get_ports {code_out[28]}]
set_load -pin_load 0.003 [get_ports {code_out[27]}]
set_load -pin_load 0.003 [get_ports {code_out[26]}]
set_load -pin_load 0.003 [get_ports {code_out[25]}]
set_load -pin_load 0.003 [get_ports {code_out[24]}]
set_load -pin_load 0.003 [get_ports {code_out[23]}]
set_load -pin_load 0.003 [get_ports {code_out[22]}]
set_load -pin_load 0.003 [get_ports {code_out[21]}]
set_load -pin_load 0.003 [get_ports {code_out[20]}]
set_load -pin_load 0.003 [get_ports {code_out[19]}]
set_load -pin_load 0.003 [get_ports {code_out[18]}]
set_load -pin_load 0.003 [get_ports {code_out[17]}]
set_load -pin_load 0.003 [get_ports {code_out[16]}]
set_load -pin_load 0.003 [get_ports {code_out[15]}]
set_load -pin_load 0.003 [get_ports {code_out[14]}]
set_load -pin_load 0.003 [get_ports {code_out[13]}]
set_load -pin_load 0.003 [get_ports {code_out[12]}]
set_load -pin_load 0.003 [get_ports {code_out[11]}]
set_load -pin_load 0.003 [get_ports {code_out[10]}]
set_load -pin_load 0.003 [get_ports {code_out[9]}]
set_load -pin_load 0.003 [get_ports {code_out[8]}]
set_load -pin_load 0.003 [get_ports {code_out[7]}]
set_load -pin_load 0.003 [get_ports {code_out[6]}]
set_load -pin_load 0.003 [get_ports {code_out[5]}]
set_load -pin_load 0.003 [get_ports {code_out[4]}]
set_load -pin_load 0.003 [get_ports {code_out[3]}]
set_load -pin_load 0.003 [get_ports {code_out[2]}]
set_load -pin_load 0.003 [get_ports {code_out[1]}]
set_load -pin_load 0.003 [get_ports {code_out[0]}]
